<script>
    import { Calculator } from "svelte-heros";
    const priIp1 = [
      ["10.53.16.0/24", "10.53.16.0~10.53.16.255", "10.53.16.1"],
      ["10.53.17.0/24", "10.53.17.0~10.53.17.255", "10.53.17.1"],
      ["10.53.18.0/24", "10.53.18.0~10.53.18.255", "10.53.18.1"],
      ["10.53.19.0/24", "10.53.19.0~10.53.19.255", "10.53.19.1"],
      ["10.53.20.0/24", "10.53.20.0~10.53.20.255", "10.53.20.1"],
      ["10.53.21.0/24", "10.53.21.0~10.53.21.255", "10.53.21.1"],
      ["10.53.22.0/24", "10.53.22.0~10.53.22.255", "10.53.22.1"],
      ["10.53.23.0/24", "10.53.23.0~10.53.23.255", "10.53.23.1"],
      ["10.53.24.0/24", "10.53.24.0~10.53.24.255", "10.53.24.1"],
      ["10.53.25.0/24", "10.53.25.0~10.53.25.255", "10.53.25.1"],
      ["10.53.26.0/24", "10.53.26.0~10.53.26.255", "10.53.26.1"],
      ["10.53.27.0/24", "10.53.27.0~10.53.27.255", "10.53.27.1"],
      ["10.53.28.0/24", "10.53.28.0~10.53.28.255", "10.53.28.1"],
      ["10.53.29.0/24", "10.53.29.0~10.53.29.255", "10.53.29.1"],
      ["10.53.30.0/24", "10.53.30.0~10.53.30.255", "10.53.30.1"],
      ["10.53.31.0/24", "10.53.31.0~10.53.31.255", "10.53.31.1"],
    ];
    const priIp2 = [
      ["10.157.232.0/24", "10.157.232.0~10.157.232.255", "10.157.232.1"],
      ["10.157.233.0/24", "10.157.233.0~10.157.233.255", "10.157.233.1"],
      ["10.157.234.0/24", "10.157.234.0~10.157.234.255", "10.157.234.1"],
      ["10.157.235.0/24", "10.157.235.0~10.157.235.255", "10.157.235.1"],
      ["10.157.236.0/24", "10.157.236.0~10.157.236.255", "10.157.236.1"],
      ["10.157.237.0/24", "10.157.237.0~10.157.237.255", "10.157.237.1"],
      ["10.157.238.0/24", "10.157.238.0~10.157.238.255", "10.157.238.1"],
      ["10.157.239.0/24", "10.157.239.0~10.157.239.255", "10.157.239.1"],
    ];
  </script>
  
  <div class="w-full">
    <div class="m-3 p-3 text-lg border-rose-400 border-l-8 font-bold ">
      사설 IP
    </div>
    <div class="m-3">
      <table class="table-auto w-full border-slate-400 border-solid border-[1px]">
        <thead>
          <tr>
            <th class="border-slate-400 border-solid border-[1px]">순번</th>
            <th>IP대역(CIDR)</th>
            <th>IP대역</th>
            <th>GateWay</th>
            <th>NetMask</th>
          </tr>
        </thead>
        <tbody>
          {#each priIp1 as ip, idx}
            <tr
              class="text-center border-slate-400 border-solid border-[1px] text-sm"
            >
              <td class="p-1 border-slate-400 border-solid border-[1px]"
                >{idx + 1}</td
              >
              <td>{ip[0]}</td>
              <td>{ip[1]}</td>
              <td>{ip[2]}</td>
              <td>255.255.255.0</td>
            </tr>
          {/each}
        </tbody>
      </table>
    </div>
    <div class="m-3 p-3 text-lg border-rose-400 border-l-8 font-bold ">
      무선망 IP
    </div>
    <div class="m-3">
      <table class="table-auto w-full border-slate-400 border-solid border-[1px]">
        <thead>
          <tr>
            <th class="border-slate-400 border-solid border-[1px]">순번</th>
            <th>IP대역(CIDR)</th>
            <th>IP대역</th>
            <th>GateWay</th>
            <th>NetMask</th>
          </tr>
        </thead>
        <tbody>
          {#each priIp2 as ip, idx}
            <tr
              class="text-center border-slate-400 border-solid border-[1px] text-sm"
            >
              <td class="p-1 border-slate-400 border-solid border-[1px]"
                >{idx + 1}</td
              >
              <td>{ip[0]}</td>
              <td>{ip[1]}</td>
              <td>{ip[2]}</td>
              <td>255.255.255.0</td>
            </tr>
          {/each}
        </tbody>
      </table>
    </div>
  </div>
  